Revit 2027 API
RebarHookType.Style Property
 The hook may only be applied to shapes of the specified style.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarStyle Style { get; set; }
Public Property Style As RebarStyle
	Get
	Set
public:
property RebarStyle Style {
	RebarStyle get ();
	void set (RebarStyle value);
}
member Style : RebarStyle with get, set
Property Value
RebarStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace